[M_IrisEp2_CultOfPersonality MissionDefinition]
MissionName="Meaning: desire to destroy"
MissionDescription="The Torga Bastards tournament is officially registered. !!Thank you very much!! If you want to progress, you have to participate in various tournaments and defeat the best wrestlers..<br><br>The first game is Doom Quest, where you must defeat a group of tax criminals called the Court of Doom..<br><br>kill them all."
TurnInDescription="You survive a heinous event of destruction and enter the tournament as the fifth greatest villain. His assistant gave him a piston pistol."
MissionSummary="Defeat the terrorists and avoid severe starvation.."
MissionGiver="war"
MissionTurnInLocation="Price box"
TeaserText="Survive the thirst for destruction!!"

[M_IrisEp2_CultOfPersonality:FindChest MissionObjectiveDefinition]
ProgressMessage="A treasure was found"

[M_IrisEp2_CultOfPersonality:GatherPlayers MissionObjectiveDefinition]
ProgressMessage="hold the battle"

[M_IrisEp2_CultOfPersonality:KillWavefour MissionObjectiveDefinition]
ProgressMessage="Kill everyone in the fourth wave"

[M_IrisEp2_CultOfPersonality:KillWaveOne MissionObjectiveDefinition]
ProgressMessage="Kill everyone in the first wave."

[M_IrisEp2_CultOfPersonality:KillWaveThree MissionObjectiveDefinition]
ProgressMessage="Kill everyone in the third tank"

[M_IrisEp2_CultOfPersonality:KillWaveTwo MissionObjectiveDefinition]
ProgressMessage="Kill them all in the second wave"

[M_IrisEp2_CultOfPersonality:LastManStanding MissionObjectiveDefinition]
ProgressMessage="Avoid groups"

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:MissionObjectiveSetDefinition_8 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_CultOfPersonality:PreGather MissionObjectiveDefinition]
ProgressMessage="Wait until the ring is ready."

[M_IrisEp2_FindBattle MissionDefinition]
MissionName="Ellie's daughter, Ellie."
MissionDescription="He survived the Test of Slaughter event and placed 5th in the competition! Your mailbox help.<br><br>The weapons store was empty.<br><br>There's something here, and it's not just a metaphor. He traveled, but there was nothing new. Avoid them throwing items at you and you'll have time to level up later."
TurnInDescription="Pete Brenner will release the stolen guard if you give him something of value.."
MissionSummary="The bread was given even though it was stale."
MissionGiver="piston"
MissionTurnInLocation="Fight with Pyro Pete"
TeaserText=""

[M_IrisEp2_FindBattle:LeaveArena MissionObjectiveDefinition]
ProgressMessage="Get out of this picture"

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_10 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="You made a clip. He drugged you, ordered you out of the bar, and made you think you were running around like a chicken.."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_11 MissionObjectiveSetDefinition]
MissionSummaryOverride="Go to Beatdown to find new sponsors.."
MissionDescriptionOverride="Clips was playing with you, he got you drunk and I told you to leave the stage and keep everyone away like a chicken..<br><br>Unfortunately, so does your sponsor. You can't go any further, sir. Torg advises you to go [place]to kill[-place] Find a new one."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_12 MissionObjectiveSetDefinition]
MissionSummaryOverride="Fire Find Pere and save his guardian."
MissionDescriptionOverride="The wart is playing you. I gave them medicine and asked them to leave and they all organized and ran like chickens..<br><br>Unfortunately, because he is your patron, you cannot level up at this time. Turgi offered to go. [place]Cua Cua[-place] Find innovation..<br><br>It turns out that a gladiator named Purple Pete has kidnapped the boss you're looking for. Find a question and find out how to submit it to a sponsor.."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_13 MissionObjectiveSetDefinition]
MissionSummaryOverride="Find the Pyro Battle Board in Pete's Bar to start Pete's Battle."
MissionDescriptionOverride="The gun is playing tricks on you. He gives you medicine to get you out of this place and convinces you to run away like a chicken..<br><br>Too bad he's your patron and you can't level up right away. The Dark Lord advises you to leave. [place]massacre[-place] and see new things.<br><br>A fan favorite was a gladiator named Pyro Pete. If it's too noisy, they should leave. [place]massacre[-place]. <br><br>You have no reason to take his word for it, but hey, you know..<br><br>It is very good."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_14 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_7 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp2_FindBattle:ReachBeatdown MissionObjectiveDefinition]
ProgressMessage="Go to Beatdown."

[M_IrisEp2_FindBattle:ReachtheBeatdownMissionBoard MissionObjectiveDefinition]
ProgressMessage="Go to the Pyro Pit"

[M_IrisEp2_FindBattle:Waypoint0 MissionObjectiveDefinition]
ProgressMessage="Do the rounds."

[M_IrisEp2_FindBattle:Waypoint3 MissionObjectiveDefinition]
ProgressMessage="Attack the rhythm"

[M_IrisEp2_FindBattle:Waypoint4 MissionObjectiveDefinition]
ProgressMessage="tower block"

[M_IrisEp2_FindBattle:Waypoint5 MissionObjectiveDefinition]
ProgressMessage="Beatdown is a journey"

[M_IrisEp2_FindBattle:Waypoint6 MissionObjectiveDefinition]
ProgressMessage="Get together and go to Beatdown."

[M_IrisEp2_FindBattle:Waypoint7 MissionObjectiveDefinition]
ProgressMessage="Beat Tour"

